STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/hap_app.c
    case HAP_HA_ACTIVE_PRESET_EVT:
    {
      HAP_ActivePreset_Info_t *p_preset_info = (HAP_ActivePreset_Info_t *) pNotification->pInfo;
      uint8_t i;
      LOG_INFO_APP("HAP Set Active Preset on preset id %d\n", p_preset_info->pPreset->Index);

      for (i = 0; i < APP_HAP_NUM_PRESETS; i++)
      {
        if (aPresetRecord[i].Index == p_preset_info->pPreset->Index)
        {
          ActiveIndex = aPresetRecord[i].Index;
          Menu_SetPresetID(ActiveIndex);
          Menu_SetPresetName((char *) aPresetRecord[ActiveIndex-1].Name);
          break;
        }
      }

      break;
    }

    case HAP_HA_PRESET_NAME_UPDATE_EVT:
    {
      HAP_Preset_t *p_preset = (HAP_Preset_t *) pNotification->pInfo;
      uint8_t i;

      LOG_INFO_APP("HAP Set Preset Name on preset id %d\n", p_preset->Index);

      for (i = 0; i < APP_HAP_NUM_PRESETS; i++)
      {
        if (aPresetRecord[i].Index == p_preset->Index)
        {
          memcpy(aPresetRecord[i].Name, p_preset->Name, p_preset->NameLen);
          aPresetRecord[i].Name[p_preset->NameLen] = '\0';
        }
      }
      break;
    }

    case HAP_HA_IAS_ALERT_EVT:
    {
      uint8_t alert_level = *pNotification->pInfo;

      switch (alert_level)
      {
        case 0x00:
        {
          LOG_INFO_APP("Alert Level received: No Alert\n");
          break;
        }
        case 0x01:
        {
          LOG_INFO_APP("Alert Level received: Mild Alert\n");
          break;
        }
        case 0x02:
        {
          LOG_INFO_APP("Alert Level received: High Alert\n");
          break;
        }
      }

      break;
    }

    default:
      break;
  }
}

uint8_t HAPAPP_StartAdvertising(CAP_Announcement_t AnnouncementType,uint8_t EnableSolicitationRequest,
                                 uint16_t Appearance)
{
  tBleStatus status;
  uint8_t advPacketLen;
  uint8_t Primary_Adv_Channel_Map = ADV_CH_37 | ADV_CH_38 | ADV_CH_39;
  uint8_t Adv_TX_Power = 0x00;
  uint8_t Scan_Req_Notification_Enable = 0x00;
  uint8_t Secondary_Adv_Max_Skip = 0x00;
  const uint8_t Peer_Address[BD_ADDR_SIZE_LOCAL] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint8_t Pb_Addr_Len;
  uint8_t Pb_Addr[6] = {0x00};
  uint8_t Adv_Data[ADV_LEN] = {(ADV_AD_FLAGS_LEN-1), AD_TYPE_FLAGS, (FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE|FLAG_BIT_BR_EDR_NOT_SUPPORTED),
                               (ADV_LOCAL_NAME_LEN-1), AD_TYPE_COMPLETE_LOCAL_NAME,
                                 'S','T','M', '3', '2', 'W','B','A', '_', '0', '0', '0', '0'};
#if (CFG_TEST_VALIDATION == 1u)
  Adv_Data[5] = 'H';
  Adv_Data[6] = 'A';
  Adv_Data[7] = 'P';
  Adv_Data[8] = '_';
  Adv_Data[9] = '_';
#endif /*(CFG_TEST_VALIDATION == 1u)*/
  aci_hal_read_config_data(CONFIG_DATA_PUBADDR_OFFSET, &Pb_Addr_Len, &Pb_Addr[0]);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-4] = Hex_To_Char((Pb_Addr[1] & 0xF0) >> 4);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-3] = Hex_To_Char(Pb_Addr[1] & 0x0F);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-2] = Hex_To_Char((Pb_Addr[0] & 0xF0) >> 4);
  Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-1] = Hex_To_Char(Pb_Addr[0] & 0x0F);

  Menu_SetIdentifier((char *)&Adv_Data[ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN-4]);

  /* Start Fast or Low Power Advertising.
   * Set Primary_Adv_Interval_Min and Primary_Adv_Interval_Max not a value multiple to possible audio
   * Frame duration
   */
  status = aci_gap_adv_set_configuration(ADV_IND,
                                         0,
                                         HCI_ADV_EVENT_PROP_CONNECTABLE,
                                         0x0088,
                                         0x0088,
                                         Primary_Adv_Channel_Map,
                                         GAP_PUBLIC_ADDR,
                                         GAP_PUBLIC_ADDR,
                                         Peer_Address,
                                         NO_WHITE_LIST_USE,
                                         Adv_TX_Power,
                                         Secondary_Adv_Max_Skip,
                                         0x01,
                                         0,
                                         Scan_Req_Notification_Enable);
  LOG_INFO_APP("hci_le_set_extended_advertising_data() returns status 0x%02X\n",status);
  if (status != BLE_STATUS_SUCCESS)
  {
    return status;
  }

  // Set Extended Advertising data
  HAPAPP_BuildAdvDataPacket(&Adv_Data[(ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN)],
                            &advPacketLen,
                            AnnouncementType,
                            EnableSolicitationRequest,
                            Appearance);
  LOG_INFO_APP("CAP Advertising Packet (Length : %d) :\n", advPacketLen);

  status = hci_le_set_extended_advertising_data(0,
                                                HCI_SET_ADV_DATA_OPERATION_COMPLETE,
                                                0,
                                                (ADV_AD_FLAGS_LEN+ADV_LOCAL_NAME_LEN+advPacketLen),
                                                &Adv_Data[0]);
  LOG_INFO_APP("hci_le_set_extended_advertising_data() returns status 0x%02X\n",status);
  if (status != BLE_STATUS_SUCCESS)
  {
    return status;
  }

  /* Enable Extended Advertising */
  Adv_Set_t adv_set;
  adv_set.Advertising_Handle = 0;
  adv_set.Duration = 0;
  adv_set.Max_Extended_Advertising_Events = 0;
  status = hci_le_set_extended_advertising_enable(0x01, 1, &adv_set);
  LOG_INFO_APP("hci_le_set_extended_advertising_enable() returns status 0x%02X\n",status);
  return status;
}

uint8_t HAPAPP_StopAdvertising(void)
{
  Adv_Set_t adv_set;
  uint8_t status;
  adv_set.Advertising_Handle = 0;
  adv_set.Duration = 0;
  adv_set.Max_Extended_Advertising_Events = 0;

  status = hci_le_set_extended_advertising_enable(0, 1, &adv_set);

  return status;
}

uint8_t HAPAPP_Disconnect(void)
{
  uint8_t status = BLE_STATUS_FAILED;
  for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
  {
    if ( HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
    {
      status = hci_disconnect(HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                              HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE);
      LOG_INFO_APP("hci_disconnect() of ConnHandle 0x%04X returns status 0x%02X\n",
                   HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                   status);
    }
  }

