STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/hap_app.c
void APP_NotifyTxAudioCplt(uint16_t AudioFrameSize)
{
  uint8_t i;
  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (HAPAPP_Context.cis_snk_handle[i] != 0xFFFFu)
    {
      CODEC_ReceiveData(HAPAPP_Context.cis_snk_handle[i], 1, &aSnkBuff[0] + AudioFrameSize/2 + i);
    }
  }
}

void APP_NotifyTxAudioHalfCplt(void)
{
  uint8_t i;
  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (HAPAPP_Context.cis_snk_handle[i] != 0xFFFFu)
    {
      CODEC_ReceiveData(HAPAPP_Context.cis_snk_handle[i], 1, &aSnkBuff[0] + i);
    }
  }
}

void CODEC_NotifyDataReady(uint16_t conn_handle, void* decoded_data, uint8_t channel_idx, uint8_t channel_nb)
{
  /* When only one channel is active, duplicate it for fake stereo on SAI */
  uint32_t i;
  uint16_t *pData = (uint16_t *)(decoded_data);   /* 16 bits samples */

  if(pData == (pPrevData + 1)){
    /* we start receiving two channels */
    Nb_Active_Ch = 2;
  }
  pPrevData = pData;

  if (Nb_Active_Ch < 2)
  {
    for (i = 0; i < Sink_frame_size/2; i+=2)
    {
      /* decoded_data is organized with a decimation equal to 2, so we duplicate each sample */
      pData[i+1] = pData[i];
    }
  }
}

void APP_NotifyRxAudioCplt(uint16_t AudioFrameSize)
{
  uint8_t i;
#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1)
  if (MicMute == 1)
  {
    /* Invalidate Rx data if microphone is mute */
    MEMSET(&aSrcBuff[0] + Source_frame_size/2, 0, Source_frame_size);
  }
#endif /* (APP_MICP_ROLE_DEVICE_SUPPORT == 1) */

  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (HAPAPP_Context.cis_src_handle[i] != 0xFFFFu)
    {
      CODEC_SendData(HAPAPP_Context.cis_src_handle[i], 1, &aSrcBuff[0] + AudioFrameSize/2 + i);
    }
  }
}

void APP_NotifyRxAudioHalfCplt(void)
{
  uint8_t i;
#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1)
  if (MicMute == 1)
  {
    /* Invalidate Rx data if microphone is mute */
    MEMSET(&aSrcBuff[0], 0, Source_frame_size);
  }
#endif /* (APP_MICP_ROLE_DEVICE_SUPPORT == 1) */

  for (i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (HAPAPP_Context.cis_src_handle[i] != 0xFFFFu)
    {
      CODEC_SendData(HAPAPP_Context.cis_src_handle[i], 1, &aSrcBuff[0]+i);
    }
  }
}

void HAPAPP_AclConnected(uint16_t ConnHandle, uint8_t Peer_Address_Type, uint8_t Peer_Address[6], uint8_t role)
{
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(ConnHandle);
  if (p_conn == 0)
  {
    p_conn = APP_AllocateACLConn(ConnHandle);
  }
  if (p_conn != 0)
  {
    p_conn->AudioProfile = AUDIO_PROFILE_NONE;
    Menu_SetProfilesLinked(p_conn->AudioProfile);
    p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_NONE;
    p_conn->Peer_Address_Type = Peer_Address_Type;
    for (uint8_t i = 0 ; i < 6u; i++)
    {
      p_conn->Peer_Address[i] = Peer_Address[i];
    }
    p_conn->Role = role;
    for (uint8_t i = 0; i < CFG_BLE_NUM_LINK;i++)
    {
      if (HAPAPP_Context.aASEs[i].acl_conn_handle == 0xFFFFu)
      {
        p_conn->pASEs = &HAPAPP_Context.aASEs[i];
        p_conn->pASEs->acl_conn_handle = ConnHandle;
        break;
      }
    }
    /* Set Available Audio Contexts */
    p_conn->AvailableSnkAudioContext = HAPAPP_Context.AvailableSnkAudioContext;
    p_conn->AvailableSrcAudioContext = HAPAPP_Context.AvailableSrcAudioContext;
  }

  HAPAPP_Context.NumConn++;
  if (HAPAPP_Context.NumConn < CFG_BLE_NUM_LINK )
  {
    tBleStatus status;
    HAPAPP_StopAdvertising();
    /* Start Advertising */
    status = HAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, 0, GAP_APPEARANCE_GENERIC_HEARING_AID);
    LOG_INFO_APP("HAPAPP_StartAdvertising() returns status 0x%02X\n",status);
    UNUSED(status);
  }
}

void HAPAPP_ConfirmIndicationRequired(uint16_t Conn_Handle)
{
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(Conn_Handle);
  if (p_conn != 0)
  {
    p_conn->ConfirmIndicationRequired = 1u;
  }
}

void HAPAPP_BondLost(uint16_t Conn_Handle)
{
  /* Force COMPLETE_LINKUP */
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(Conn_Handle);
  if (p_conn != 0)
  {
    switch (p_conn->CAPLinkupState)
    {
      case APP_CAP_LINKUP_STATE_NONE:
      case APP_CAP_LINKUP_STATE_STARTED_RESTORE:
      {
        p_conn->ForceCompleteLinkup = 1u;
        break;
      }
      case APP_CAP_LINKUP_STATE_DONE_RESTORE:
      {
        tBleStatus ret;

        /* Unlink CAP to perform CAP Complete Linkup */
        CAP_Unlink(p_conn->Acl_Conn_Handle, MCP_LINK | CCP_LINK, 0x00);
        ret = CAP_Linkup(p_conn->Acl_Conn_Handle, MCP_LINK | CCP_LINK, 0x01);
        LOG_INFO_APP("CAP_Linkup() on ConnHandle 0x%04x for link mask 0x%02X returns status 0x%02X\n",
                    p_conn->Acl_Conn_Handle,
                    MCP_LINK | CCP_LINK,
                    ret);
        UNUSED(ret);

        p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_STARTED_COMPLETE;
        break;
      }
      default:
      {
        /* Nothing to do */
        break;
      }
    }
  }
}

void HAPAPP_CISConnected(uint16_t Conn_Handle)
{
  for (uint8_t i = 0; i< APP_MAX_NUM_CIS; i++)
  {
    if (HAPAPP_Context.cis_handle[i] == 0xFFFFu)
    {
      HAPAPP_Context.cis_handle[i] = Conn_Handle;
      HAPAPP_Context.num_cis_established++;
      break;
    }
  }
}

void HAPAPP_LinkDisconnected(uint16_t Conn_Handle,uint8_t Reason)
{
  uint8_t i;
  uint8_t status;
  Audio_Context_t snk_context = 0x0000;
  Audio_Context_t src_context = 0x0000;

  APP_ACL_Conn_t *p_conn = APP_GetACLConn(Conn_Handle);
  if (p_conn != 0)
  {
    /*Free CAP Connection Slot*/
    p_conn->Acl_Conn_Handle = 0xFFFFu;
    p_conn->AudioProfile = AUDIO_PROFILE_NONE;
    Menu_SetProfilesLinked(p_conn->AudioProfile);
    p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_NONE;
    p_conn->LinkupRetry = 0;
    p_conn->ConfirmIndicationRequired = 0u;
    p_conn->ForceCompleteLinkup = 0u;
    p_conn->CurrentContentCtrlOp = 0x0000;
    p_conn->PendingContentCtrlOp = 0x0000;
    HAPAPP_Context.NumConn--;

#if (APP_NUM_SNK_ASE > 0u)
    for ( i = 0; i < APP_NUM_SNK_ASE;i++)
    {
      if (p_conn->pASEs->aSnkASE[i].allocated != 0x00)
      {
        if ( p_conn->pASEs->aSnkASE[i].streaming_audio_context != 0x0000u)
        {
          /* Calculate the available Audio Contexts now ASEs have 'released' streaming audio contexts */
          snk_context |= APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                               &p_conn->pASEs->aSnkASE[i],
                                                               p_conn->pASEs->aSnkASE[i].streaming_audio_context);
        }
        LOG_INFO_APP("Free ASE ID %d on ACL connection handle 0x%04X\n",p_conn->pASEs->aSnkASE[i].ID,Conn_Handle);
        p_conn->pASEs->aSnkASE[i].ID = 0x00;
        p_conn->pASEs->aSnkASE[i].state  = ASE_STATE_IDLE;
        p_conn->pASEs->aSnkASE[i].num_channels  = 0x00;
        p_conn->pASEs->aSnkASE[i].streaming_audio_context = 0x00u;
        p_conn->pASEs->aSnkASE[i].allocated = 0x00u;
      }
    }
#endif /*(APP_NUM_SNK_ASE > 0u)*/
#if (APP_NUM_SRC_ASE > 0u)
    for ( i = 0; i < APP_NUM_SRC_ASE;i++)
    {
      if (p_conn->pASEs->aSrcASE[i].allocated != 0x00)
      {
        if ( p_conn->pASEs->aSrcASE[i].streaming_audio_context != 0x0000u)
        {
          /* Calculate the available Audio Contexts now ASEs have 'released' streaming audio contexts */
          src_context |= APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                               &p_conn->pASEs->aSrcASE[i],
                                                               p_conn->pASEs->aSrcASE[i].streaming_audio_context);
        }
        LOG_INFO_APP("Free ASE ID %d on ACL connection handle 0x%04X\n",p_conn->pASEs->aSrcASE[i].ID,Conn_Handle);
        p_conn->pASEs->aSrcASE[i].ID = 0x00;
        p_conn->pASEs->aSrcASE[i].state  = ASE_STATE_IDLE;
        p_conn->pASEs->aSrcASE[i].num_channels  = 0x00;
        p_conn->pASEs->aSrcASE[i].streaming_audio_context = 0x00u;
        p_conn->pASEs->aSrcASE[i].allocated = 0x00u;
      }
    }
#endif /*(APP_NUM_SRC_ASE > 0u)*/

    p_conn->pASEs->acl_conn_handle = 0xFFFFu;
    p_conn->pASEs = 0;
    p_conn->AvailableSnkAudioContext = 0x0000u;
    p_conn->AvailableSrcAudioContext = 0x0000u;

    /* if context are now available, update them */
    if ((snk_context != 0x0000) || (src_context != 0x0000) )
    {
      uint8_t enable_ongoing = 0u;
      APP_ACL_Conn_t *p_other_conn;

