STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/hap_app.c
  return status;
}

static tBleStatus HAPAPP_HAPInit(HAP_Role_t Role, uint8_t CSIPConfId)
{
  uint8_t status;

  status = USECASE_DEV_MGMT_Init();
  LOG_INFO_APP("Init Usecase Dev Management with status 0x%02X\n", status);
  if (status == BLE_STATUS_SUCCESS)
  {
    status = HAP_Init(Role);
    LOG_INFO_APP("Init HAP with status 0x%02X\n", status);

    if (status == BLE_STATUS_SUCCESS)
    {
      uint8_t i;
      uint8_t pres_index = 0;

      switch (CSIPConfId)
      {
        case 0x00:
          status = HAP_HA_SetHearingAidFeatures(HAP_HA_TYPE_BANDED_HEARING_AID);
          break;
        case 0x01:
        case 0x02:
          status = HAP_HA_SetHearingAidFeatures(HAP_HA_TYPE_BINAURAL_HEARING_AID);
          break;
        case 0x03:
          status = HAP_HA_SetHearingAidFeatures(HAP_HA_TYPE_MONAURAL_HEARING_AID);
          break;
      }
      LOG_INFO_APP("Set HA Features with status 0x%02X\n", status);

      for (i = 0; ((i < APP_HAP_NUM_PRESETS) && (status == BLE_STATUS_SUCCESS)); i++)
      {
        status = HAP_HA_AddPreset(aPresetRecord[i].Properties, (uint8_t *) &aPresetRecord[i].Name,
                                  strlen(aPresetRecord[i].Name), &pres_index);
        LOG_INFO_APP("Added preset %s (ID %d) with status 0x%02X\n", aPresetRecord[i].Name, pres_index, status);

        aPresetRecord[i].Index = pres_index;
      }
      if (status == BLE_STATUS_SUCCESS)
      {
        status = HAP_HA_SetActivePresetIndex(aPresetRecord[0].Index);
        LOG_INFO_APP("Set Active Preset Index %d with status 0x%02X\n", aPresetRecord[0].Index, status);
        ActiveIndex = aPresetRecord[0].Index;

        Menu_SetPresetID(ActiveIndex);
        Menu_SetPresetName((char *) aPresetRecord[ActiveIndex-1].Name);
      }
    }
  }

  return status;
}

/**
  * @brief  Notify CAP Events for App
  * @param  pNotification: pointer on notification information
 */
static void HAPAPP_CAPNotification(CAP_Notification_Evt_t *pNotification)
{
  LOG_INFO_APP("CAP Event : 0x%02X\n",pNotification->EvtOpcode);

  switch(pNotification->EvtOpcode)
  {
    case CAP_LINKUP_COMPLETE_EVT:
    {
      GAF_Profiles_Link_t current_link = CAP_GetCurrentLinkedGAFProfiles(pNotification->ConnHandle);
      APP_ACL_Conn_t *p_conn;
      LOG_INFO_APP("CAP Linkup Complete on Connhandle 0x%04X with status 0x%02X\n",
                   pNotification->ConnHandle,
                   pNotification->Status);

      LOG_INFO_APP("profiles 0x%02X of the GAF are linked on ConnHandle 0x%04x\n",
                    current_link,
                    pNotification->ConnHandle);
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if (p_conn != 0)
      {
        if ( current_link == 0)
        {
          if (p_conn->LinkupRetry == 0u)
          {
            /*No service has been discovery, we will retry a CAP Linkup in a moment*/
            p_conn->LinkupRetry = 1u;
            UTIL_TIMER_Create(&LinkupRetry_Timer,
                              LINKUP_RETRY_TIMEOUT,
                              UTIL_TIMER_ONESHOT,
                              &LinkupRetry_TimerCallback,
                              0);
            UTIL_TIMER_Start(&LinkupRetry_Timer);
          }
        }
        if (p_conn->LinkupRetry != 1u)
        {
          /*Check if timer should be started to perform a linkup retry with another remote device*/
          for (uint8_t conn = 0; conn < CFG_BLE_NUM_LINK ; conn++)
          {
            if ( (HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) \
                  && (HAPAPP_Context.ACL_Conn[conn].LinkupRetry == 1u))
            {
              UTIL_TIMER_Create(&LinkupRetry_Timer,
                                LINKUP_RETRY_TIMEOUT,
                                UTIL_TIMER_ONESHOT,
                                &LinkupRetry_TimerCallback,
                                0);
              UTIL_TIMER_Start(&LinkupRetry_Timer);
              break;
            }
          }
        }
        if (p_conn->ForceCompleteLinkup == 0 || p_conn->CAPLinkupState == APP_CAP_LINKUP_STATE_STARTED_COMPLETE)
        {
          if (p_conn->CAPLinkupState == APP_CAP_LINKUP_STATE_STARTED_COMPLETE)
          {
            p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_DONE_COMPLETE;
          }
          else
          {
            p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_DONE_RESTORE;
          }

          if (p_conn->ConfirmIndicationRequired == 1u)
          {
            /* Confirm indication now that the GATT is available */
            tBleStatus ret;
            GAF_Profiles_Link_t current_link;
            ret = aci_gatt_confirm_indication(pNotification->ConnHandle);
            if (ret != BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("  Fail   : aci_gatt_confirm_indication command, result: 0x%02X\n", ret);
            }
            else
            {
              LOG_INFO_APP("  Success: aci_gatt_confirm_indication command\n");
            }
            p_conn->ConfirmIndicationRequired = 0u;
            current_link = CAP_GetCurrentLinkedGAFProfiles(pNotification->ConnHandle);

#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1)
            if ((current_link & CCP_LINK) == CCP_LINK)
            {
              ret = CCP_CLIENT_ReadCallState(pNotification->ConnHandle,
                                             p_conn->GenericTelephoneBearerCCID);
              if (ret != BLE_STATUS_SUCCESS)
              {
                if ((ret == BLE_STATUS_BUSY) && (p_conn != 0))
                {
                  p_conn->PendingContentCtrlOp |= CCP_CLT_OP_READ_CALL_STATE;
                }
                LOG_INFO_APP("  Fail   : CCP_CLIENT_ReadCallState with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                             pNotification->ConnHandle,
                             p_conn->GenericTelephoneBearerCCID,
                             ret);
              }
              else
              {
                if (p_conn != 0)
                {
                  p_conn->CurrentContentCtrlOp |= CCP_CLT_OP_READ_CALL_STATE;
                }
                LOG_INFO_APP("  Success: CCP_CLIENT_ReadCallState with ConnHandle 0x%04X and CCID %d\n",
                             pNotification->ConnHandle,
                             p_conn->GenericTelephoneBearerCCID);
              }
            }
#endif /* (APP_CCP_ROLE_CLIENT_SUPPORT == 1) */
          }
          p_conn->ForceCompleteLinkup = 0;
        }
        else
        {
          tBleStatus ret;

          /* Unlink CAP to perform CAP Complete Linkup */
          CAP_Unlink(p_conn->Acl_Conn_Handle, MCP_LINK | CCP_LINK, 0x00);
          ret = CAP_Linkup(p_conn->Acl_Conn_Handle, MCP_LINK | CCP_LINK, 0x01);
          LOG_INFO_APP("CAP_Linkup() on ConnHandle 0x%04x for link mask 0x%02X returns status 0x%02X\n",
                      p_conn->Acl_Conn_Handle,
                      MCP_LINK | CCP_LINK,
                      ret);
          UNUSED(ret);

          p_conn->CAPLinkupState = APP_CAP_LINKUP_STATE_STARTED_COMPLETE;
        }
      }
      break;
    }

