STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/hap_app.c
          hci_read_local_supported_controller_delay((const uint8_t*)&a_codec_id,
                                                     0x02,
                                                     DATA_PATH_OUTPUT,
                                                     0,
                                                     NULL,
                                                     (uint8_t*)&controller_delay_margin_snk,
                                                     (uint8_t*)&max_controller_delay);

           hci_read_local_supported_controller_delay((const uint8_t*)&a_codec_id,
                                                      0x02,
                                                      DATA_PATH_INPUT,
                                                      0,
                                                      NULL,
                                                      (uint8_t*)&controller_delay_margin_src,
                                                      (uint8_t*)&max_controller_delay);

          if (num_src_ases > 0)
          {
            if (num_src_ases > 1)
            {
              controller_delay_min = controller_delay_min - (controller_delay_margin_src * (num_src_ases - 1));
            }
            /* if a source is present, processing margin are already included for that frame duration */
            controller_delay_min = controller_delay_min - (controller_delay_margin_snk * num_snk_ases);
          }
          else
          {
            if( num_snk_ases > 0)
            {
              controller_delay_min = controller_delay_min - (controller_delay_margin_snk * (num_snk_ases - 1));
            }
          }
        }

        LOG_INFO_APP("Computed Min Controller Delay with %d Snk ASEs and %d Src ASEs : %d us\n",
            num_snk_ases,
            num_src_ases,
            controller_delay_min);

        /*check if computed minimum controller delay is compliant with the frame */
        if (frame_duration == FRAME_DURATION_7_5_MS)
        {
          if(controller_delay_min > sduInterval)
          {
            LOG_INFO_APP("WARNING : Computed Controller Delay Min ( %d us) could be higher than the frame duration (7.5 ms)\n",
                        controller_delay_min);
            controller_delay_min = sduInterval;
          }
        }
        else if (frame_duration == FRAME_DURATION_10_MS)
        {
          if(controller_delay_min > sduInterval)
          {
            LOG_INFO_APP("WARNING : Controller Delay Min ( %d us) could be higher than the frame duration (10 ms)\n",
                        controller_delay_min);
            controller_delay_min = sduInterval;
          }
        }

        /*Calculate presentation delay to submitt to remote unicat client*/
        if (*(info->pResp) == ASE_OP_RESP_SUCCESS)
        {
          if (info->Type ==  ASE_SINK)
          {
            /* For the Unicast Server, the supported Presentation_Delay range in the Codec Configured state shall
             * include BAP_MANDATORY_PRESENTATION_DELAY when the ASE is a Sink ASE
             */
            if (((APP_DELAY_SNK_MIN+controller_delay_min) > BAP_MANDATORY_PRESENTATION_DELAY) \
                || ((APP_DELAY_SNK_MAX+info->SnkControllerDelayMax) < BAP_MANDATORY_PRESENTATION_DELAY))
            {
              LOG_INFO_APP("ERROR : Mandatory presentation %d us is not included in supported Presentation Delay range [%d - %d]\n",
                          BAP_MANDATORY_PRESENTATION_DELAY,
                          APP_DELAY_SNK_MIN+controller_delay_min,
                          APP_DELAY_SNK_MAX+info->SnkControllerDelayMax);
              *(info->pResp) = ASE_OP_RESP_UNSUPPORTED_CONF_PARAM;
              *(info->pReason) = ASE_OP_RESP_REASON_PRES_DELAY;
            }
            info->pPrefQoSConfRsp->PresentationDelayMin = (APP_DELAY_SNK_MIN+controller_delay_min);
            info->pPrefQoSConfRsp->PresentationDelayMax = (APP_DELAY_SNK_MAX+info->SnkControllerDelayMax);
            info->pPrefQoSConfRsp->PrefPresentationDelayMin = (APP_DELAY_SNK_MIN+controller_delay_min);
            info->pPrefQoSConfRsp->PrefPresentationDelayMax = (APP_DELAY_SNK_MAX+info->SnkControllerDelayMax);
          }
          else if (info->Type ==  ASE_SOURCE)
          {
            info->pPrefQoSConfRsp->PresentationDelayMin = (APP_DELAY_SRC_MIN+controller_delay_min);
            info->pPrefQoSConfRsp->PresentationDelayMax = (APP_DELAY_SRC_MAX+info->SrcControllerDelayMax);
            info->pPrefQoSConfRsp->PrefPresentationDelayMin = (APP_DELAY_SRC_MIN+controller_delay_min);
            info->pPrefQoSConfRsp->PrefPresentationDelayMax = (APP_DELAY_SRC_MAX+info->SrcControllerDelayMax);
          }
          LOG_INFO_APP("Submitted Min Presentation Delay %d us\n",info->pPrefQoSConfRsp->PresentationDelayMin);
          LOG_INFO_APP("Submitted Max Presentation Delay %d us\n",info->pPrefQoSConfRsp->PresentationDelayMax);
        }
        break;
    }

    case CAP_UNICAST_AUDIO_DATA_PATH_SETUP_REQ_EVT:
    {
      BAP_SetupAudioDataPathReq_t *info = (BAP_SetupAudioDataPathReq_t *)pNotification->pInfo;
      uint32_t controller_delay;
      APP_ASE_Info_t *p_ase;
      if (info->PathDirection == BAP_AUDIO_PATH_INPUT)
      {
        LOG_INFO_APP("Setup Input Audio Data Path is requested for ASE ID %d on ACL Conn Handle 0x%04X (CIS Conn Handle 0x%04X)\n",
                     info->ASE_ID,
                     pNotification->ConnHandle,
                     info->CIS_ConnHandle);
      }
      else
      {
        LOG_INFO_APP("Setup Output Audio Data Path is requested for ASE ID %d on ACL Conn Handle 0x%04X (CIS Conn Handle 0x%04X)\n",
                   info->ASE_ID,
                   pNotification->ConnHandle,
                   info->CIS_ConnHandle);
      }
      LOG_INFO_APP("  Codec ID\n");
      LOG_INFO_APP("    Coding format : 0x%02X\n",info->CodecConf.CodecID.CodingFormat);
      LOG_INFO_APP("    Company id : 0x%04X\n",info->CodecConf.CodecID.CompanyID);
      LOG_INFO_APP("    VS codec id : 0x%04X\n",info->CodecConf.CodecID.VsCodecID);
      LOG_INFO_APP("  Presentation Delay %d us\n",info->PresentationDelay);
      LOG_INFO_APP("  Min Controller Delay %d us\n",info->ControllerDelayMin);
      LOG_INFO_APP("  Max Controller Delay %d us\n",info->ControllerDelayMax);

      /* BAP_ROLE_UNICAST_SERVER */
      if (info->PathDirection == BAP_AUDIO_PATH_INPUT)
      {
        /* Source for Unicast Server*/
        controller_delay = info->PresentationDelay - APP_DELAY_SRC_MIN;
        if ( controller_delay > info->ControllerDelayMax)
        {
          controller_delay = info->ControllerDelayMax;
        }
      }
      else /* (info->PathDirection == BAP_AUDIO_PATH_OUTPUT)*/
      {
        /* Sink for Unicast Server*/
        controller_delay = info->PresentationDelay - APP_DELAY_SNK_MIN;
        if ( controller_delay > info->ControllerDelayMax)
        {
          controller_delay = info->ControllerDelayMax;
        }
      }

      p_ase = APP_GetASE(info->ASE_ID,pNotification->ConnHandle);
      if (p_ase != 0)
      {
        p_ase->controller_delay = controller_delay;
        p_ase->presentation_delay = info->PresentationDelay;
      }

      APP_UnicastSetupAudioDataPath(pNotification->ConnHandle,info->CIS_ConnHandle,info->ASE_ID,controller_delay);
      break;
    }

    case CAP_AUDIO_CLOCK_REQ_EVT:
    {
      Sampling_Freq_t *freq = (Sampling_Freq_t *)pNotification->pInfo;
      LOG_INFO_APP("Init Audio Clock with freq %d\n",*freq);
      AudioClock_Init(*freq);
      break;
    }

    case CAP_UNICAST_AUDIO_CONNECTION_UP_EVT:
    {
      BAP_Unicast_Audio_Path_t *info = (BAP_Unicast_Audio_Path_t *)pNotification->pInfo;

      if (info->AudioPathDirection == BAP_AUDIO_PATH_INPUT){
        LOG_INFO_APP("Input Audio Data Path is up with status 0x%02X for CIS Conn handle 0x%04X\n",
                    pNotification->Status,info->CIS_ConnHandle);
        LOG_INFO_APP("Controller Delay : %d us\n", info->ControllerDelay);
        LOG_INFO_APP("Transport Latency : %d us\n", info->TransportLatency);
        if (pNotification->Status == 0x00)
        {
          HAPAPP_Context.audio_role_setup |= AUDIO_ROLE_SOURCE;
        }
      }
      else
      {
        Audio_Chnl_Allocation_t channel_alloc = LTV_GetConfiguredAudioChannelAllocation(info->CodecConf.pSpecificConf,
                                                                                        info->CodecConf.SpecificConfLength);
        HAPAPP_Context.NumOutputChannels += APP_GetBitsAudioChnlAllocations(channel_alloc);
        LOG_INFO_APP("Number of Output Channels Up:  %d\n", HAPAPP_Context.NumOutputChannels);
        LOG_INFO_APP("Output Audio Data Path is up with status 0x%02X for CIS Conn handle 0x%04X\n",
                    pNotification->Status,
                    info->CIS_ConnHandle);
        LOG_INFO_APP("Controller Delay : %d us\n", info->ControllerDelay);
        LOG_INFO_APP("Transport Latency : %d us\n", info->TransportLatency);
        if (pNotification->Status == 0x00)
        {
          HAPAPP_Context.audio_role_setup |= AUDIO_ROLE_SINK;
        }
      }
      break;
    }

    case CAP_UNICAST_AUDIO_CONNECTION_DOWN_EVT:
    {
      BAP_Unicast_Audio_Path_t *info = (BAP_Unicast_Audio_Path_t *)pNotification->pInfo;
      uint8_t i;

      if (info->AudioPathDirection == BAP_AUDIO_PATH_INPUT){
        LOG_INFO_APP("Input Audio Data Path is down with status 0x%02X for CIS Conn handle 0x%04X\n",
                    pNotification->Status,
                    info->CIS_ConnHandle);
        if (info->CIS_ConnHandle != 0xFFFF)
        {
          for (i = 0; i< APP_MAX_NUM_CIS; i++)
          {
            if (HAPAPP_Context.cis_src_handle[i] == info->CIS_ConnHandle)
            {
              HAPAPP_Context.cis_src_handle[i] = 0xFFFFu;
              HAPAPP_Context.num_cis_src--;
              break;
            }
          }
        }
        if (HAPAPP_Context.num_cis_src == 0u)
        {
          LOG_INFO_APP("No more Input Audio Data Path is up\n");
          HAPAPP_Context.audio_role_setup &= ~AUDIO_ROLE_SOURCE;
          LOG_INFO_APP("Stop Rx Audio Peripheral Driver\n");
          Stop_RxAudio();
        }
      }
      else
      {
        Audio_Chnl_Allocation_t channel_alloc = LTV_GetConfiguredAudioChannelAllocation(info->CodecConf.pSpecificConf,
                                                                                        info->CodecConf.SpecificConfLength);
        HAPAPP_Context.NumOutputChannels -= APP_GetBitsAudioChnlAllocations(channel_alloc);
        LOG_INFO_APP("Number of Output Channels Up:  %d\n", HAPAPP_Context.NumOutputChannels);
        LOG_INFO_APP("Output Audio Data Path is down with status 0x%02X for CIS Conn handle 0x%04X\n",
                    pNotification->Status,
                    info->CIS_ConnHandle);

